export default {
  system_error: "系統錯誤；請再試一次或重新載入",

  date_error: {
    end_ealier_start: "完結時間早於開始時間",
    past: "設定結束時間已過！",
    later_school_year_end: "完結時間不可遲於學年結束",
    invalid_end: "完結時間必須介乎於現在至本學年結束（八月卅一日）",
    invalid_bca: "開放時間須設定在 [START_DATE] [START_TIME]至 [END_DATE] [END_TIME]之間。",
    invalid_bca_mock: "開放時間須設定在 [START_DATE]至 [END_DATE]之間。",
  },

  no_target_users: "請選擇派發對象！",

  question_required: "必須有[QUESTIONS_LABEL]才可派發。",

  empty_title: "評估標題不可為空！",

  toast_message: {
    unknown: "系統錯誤",
    100: "系統錯誤",
    101: "登錄已過期",
    102: "登錄已過期",
    103: "登錄已過期",
    104: "權限不足",
    105: "此刻非開放時間",
    106: "此IP地址不可進入",
    121: "找不到試卷",
    122: "試卷未開始",
    123: "試卷已完結",
    124: "可遞交次數已達上限",
    125: "已有學生做卷",
    131: "找不到章節",
    141: "找不到題目",
    151: "找不到用戶的考卷",
    152: "用戶的考卷已遞交",
    153: "用戶的考卷已開始",
    154: "用戶的考卷未遞交",
    155: "登錄已過期",
    156: "不可於派發後更改開始時間",
    157: "結束時間有誤",
    158: "不可於派發後更改評估內容",
    159: "評估沒有內容",
    160: "評估屬於另一學校",
    161: "評估屬於以往學年",
    931: "日期時間有誤",
  },
};
